swat-dp-tools/soma/xml/modify-config.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request domain="@domain.name@">
            <dp:modify-config>
                <@service.class@ name="@service.object.name@">
                    <DebugMode>on</DebugMode>
                </@service.class@>
            </dp:modify-config>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>